{
  "alora_invocation_tokens": null,
  "alpha_pattern": {},
  "arrow_config": null,
  "auto_mapping": null,
  "base_model_name_or_path": "distilbert-base-uncased",
  "bias": "none",
  "corda_config": null,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16.0,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "classifier",
    "score"
  ],
  "peft_type": "LORA",
  "peft_version": "0.18.0",
  "qalora_group_size": 16,
  "r": 8,
  "rank_pattern": {
    "distilbert.transformer.layer.0.attention.k_lin": 2,
    "distilbert.transformer.layer.0.attention.out_lin": 2,
    "distilbert.transformer.layer.0.attention.q_lin": 2,
    "distilbert.transformer.layer.0.attention.v_lin": 2,
    "distilbert.transformer.layer.0.ffn.lin1": 32,
    "distilbert.transformer.layer.0.ffn.lin2": 2,
    "distilbert.transformer.layer.1.attention.k_lin": 2,
    "distilbert.transformer.layer.1.attention.out_lin": 4,
    "distilbert.transformer.layer.1.attention.q_lin": 2,
    "distilbert.transformer.layer.1.attention.v_lin": 5,
    "distilbert.transformer.layer.1.ffn.lin1": 17,
    "distilbert.transformer.layer.1.ffn.lin2": 7,
    "distilbert.transformer.layer.2.attention.k_lin": 2,
    "distilbert.transformer.layer.2.attention.out_lin": 4,
    "distilbert.transformer.layer.2.attention.q_lin": 2,
    "distilbert.transformer.layer.2.attention.v_lin": 15,
    "distilbert.transformer.layer.2.ffn.lin1": 32,
    "distilbert.transformer.layer.2.ffn.lin2": 5,
    "distilbert.transformer.layer.3.attention.k_lin": 2,
    "distilbert.transformer.layer.3.attention.out_lin": 3,
    "distilbert.transformer.layer.3.attention.q_lin": 2,
    "distilbert.transformer.layer.3.attention.v_lin": 23,
    "distilbert.transformer.layer.3.ffn.lin1": 32,
    "distilbert.transformer.layer.3.ffn.lin2": 2,
    "distilbert.transformer.layer.4.attention.k_lin": 2,
    "distilbert.transformer.layer.4.attention.out_lin": 3,
    "distilbert.transformer.layer.4.attention.q_lin": 2,
    "distilbert.transformer.layer.4.attention.v_lin": 11,
    "distilbert.transformer.layer.4.ffn.lin1": 28,
    "distilbert.transformer.layer.4.ffn.lin2": 3,
    "distilbert.transformer.layer.5.attention.k_lin": 2,
    "distilbert.transformer.layer.5.attention.out_lin": 3,
    "distilbert.transformer.layer.5.attention.q_lin": 2,
    "distilbert.transformer.layer.5.attention.v_lin": 9,
    "distilbert.transformer.layer.5.ffn.lin1": 7,
    "distilbert.transformer.layer.5.ffn.lin2": 2
  },
  "revision": null,
  "target_modules": [
    "lin2",
    "lin1",
    "out_lin",
    "v_lin",
    "k_lin",
    "q_lin"
  ],
  "target_parameters": null,
  "task_type": "SEQ_CLS",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}